[
    {
        "title": "\"Makes your work easy\"",
        "description": "What do you like best about Convin.ai?Reduces the workload and gives more insights on improving the process and experience Review collected by and hosted on G2.com.What do you dislike about Convin.ai?Should give us option to customize however we want Review collected by and hosted on G2.com.What problems is Convin.ai solving and how is that benefiting you?Convin enhances customer efficiency by providing intelligent, context-sensitive scripts and troubleshooting guidance that automatically appear during customer interactions. These dynamically generated audio-assisted resources enable support representatives to quickly access relevant information, significantly reducing response times and improving the overall quality of customer service.\r It is easy to use. Review collected by and hosted on G2.com.",
        "date": "2024-12-18",
        "reviewer_name": "Anil Nimbalkar .",
        "rating": "5.0"
    },
    {
        "title": "\"CONVIN for Titan Audits CRM\"",
        "description": "What do you like best about Convin.ai?Very user Friendly , Easy to navigate , auditing purpose Review collected by and hosted on G2.com.What do you dislike about Convin.ai?The AI part can be better in regards to accuracy Review collected by and hosted on G2.com.What problems is Convin.ai solving and how is that benefiting you?We used to use XL before we got trained on convin\r It helps us in regards to faster audits , the AI audit insights help us to share better feedbacks with the team. Review collected by and hosted on G2.com.",
        "date": "2025-01-06",
        "reviewer_name": "Conway Raymond Goodman .",
        "rating": "3.5"
    },
    {
        "title": "\"Review  About Conwin-- Helpful to all levels in a BPO\"",
        "description": "What do you like best about Convin.ai?Easy to use and access. It has a lot of helpful features.\r 1. Dashboard for easy visual experience\r2. Statistics provided for manual and AI audits Review collected by and hosted on G2.com.What do you dislike about Convin.ai?SOme of the reporting structures are not all comprehensive and not user friendly. There is also no clink to paste option available. If one wants to audit the auditor, the original audit gets overwritten. Review collected by and hosted on G2.com.What problems is Convin.ai solving and how is that benefiting you?Sharing feedback was tedious as every feedback had to be sent manually. Also, keeping a tab of the agents audited was tiring. This problem has been resolved with the advent of Conwin. Review collected by and hosted on G2.com.",
        "date": "2024-10-17",
        "reviewer_name": "Moumita Sarkar(QA) .",
        "rating": "5.0"
    },
    {
        "title": "\"Best audit tool\"",
        "description": "What do you like best about Convin.ai?Best features of convin includes detailed call insights, customisable scorecard, dashboards, monitoring, user friendly interface, actionable reports all driven by AI Review collected by and hosted on G2.com.What do you dislike about Convin.ai?It works on capturing the data via word basis so accuracy is not 100%. Manual audits includes the scenario however AI does not cover scenario wise audits Review collected by and hosted on G2.com.What problems is Convin.ai solving and how is that benefiting you?Detailed call insights which provides a deep   knowledge of the call and also what things to improve Review collected by and hosted on G2.com.",
        "date": "2024-10-11",
        "reviewer_name": "Nikunj M.",
        "rating": "5.0"
    }
]