[
    {
        "title": "My Xiaomi and my thoughts",
        "description": "The last update I didn't like all that much, it changed unwanted settings.I needed time to set the settings to my liking again, took some work but I appreciate that updates are still available.It's necessary and understand,If would write a program I would reconsider the experience of users and take them seriously.Sometimes we know better of experience. More opions, better working programs.I love my phone, please keep it that way. I really don't want to change to Samsung.But as always, improve to give the users the best smartphone experience, gadgets, widgets, which it seems to change, I lost all the sudden the dual clock, important to me as I travel a lot.The weather widget doesn't work no more.If something works good then keep it or you lose some.I hope to get a better version of my phone soon. Either upgrade or getting a new one but either way, I am loyal and stick with Xiaomi as long as it stays in quality and improvement.I believe Xiaomi can outdo Samsung with more finesse, creativity, knowledge and with opening your mind more what people want, like and need!But every phone has good and bad or not so good.That's normal. It depends on the user and person.But I am well satisfied. Best greetings A loyal Xiaomi Phone owner",
        "date": "2025-01-21",
        "reviewer_name": "Egal",
        "rating": "Rated 5 out of 5 stars"
    },
    {
        "title": "Awful customer service",
        "description": "Awful customer service. AVOIDBought and item that was faulty and they refused to help.AVOIDShame we can't give 0",
        "date": "2025-01-23",
        "reviewer_name": "Uncle BOB",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "POCO C65 and Redmi 13C worst phones from budget line",
        "description": "Constantly disconnecting itself from USB cable in high charge on computer, works only in laptop until discharges enough. Phantom turning on display even no keys are pressed. It has constant system bugs and errors even in stable release. Does not clear some storage when it's full. Does not release internal memory when deleting new recent files. Corrupts, destroys and deletes any data moved from internal to external storage without reporting of abstract error. Random app crashes and failures and switching to read-only mode due of file system implementation errors. Camera wastes so much storage by just recording 30 mins of video no matter of encoder used, unable to turn on flashlight during video recording. Stay away from both hell plague.",
        "date": "2025-01-03",
        "reviewer_name": "Yaroslav Kirichok",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Order a pair of gloves and receive an…",
        "description": "Order a pair of gloves and receive an email delivery confirmation but never received the item. I try to contact customer service and they respond late and was not interested to sort the problem until I contact PayPal for suport. PayPal refund me becouse item show was delivered but nobody nows where, even in email says that was delivered but not at my address. Xiaomi customer service don't respond anymore",
        "date": "2025-01-01",
        "reviewer_name": "Ionut",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "fake review",
        "description": "I bought a kettle and it suppose to be scalding free but it's completely opposite and do not have a filter so all landing in my cup . Xiaomi refused to refund or replace but the best thing is you can not leave a review on Xiaomi side pathetic.",
        "date": "2025-01-02",
        "reviewer_name": "Pawel Krzywon",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Bought a robot vacuum e10",
        "description": "Bought a robot vacuum e10. This one is the stupidest robot vacuum on earth. Can’t find the charger,never stops, don’t go from kitchen to living room, also stop on the side of the black rug and turn back. Costumer service never existed! 100£ burned…also 30 days of guarantee but you need the box! Can’t wait to destroy that machine. Avoid all cost!",
        "date": "2024-12-14",
        "reviewer_name": "Janos Pete",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "I bought 2 Xiaomi Smart bands 9",
        "description": "I bought 2 Xiaomi Smart bands 9, one for myself and one for husband.  I could not get mine to work, to sync with the phone, to register.  Xiaomi phone helpline is \"down\".  Can only contact through Facebook.  I am very disappointed regarding this situation.",
        "date": "2024-12-16",
        "reviewer_name": "Ginger Booker",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Xiaomi TV Q1 E 55 purchased less than 3…",
        "description": "Xiaomi TV Q1 E 55 purchased less than 3 years ( 2 years 5 months ) and half the screen - the right side of the screen became discoloured. Contacted their CS, tried the hard reset as recommended. Issue still persists. Still under warranty and CS had get their technician to call and arrange for the repair within 7 days. It's the fifth day, no reach out or any call from their technician. How difficult and how long does it take for a company like Xiaomi to arrange for a repair appt? Too many faulty TVs ? Most likely not a lasting brand.",
        "date": "2024-10-26",
        "reviewer_name": "Alex YL",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Purchased a Mi Band 9",
        "description": "Purchased a Mi Band 9 which was promptly deliver and appears to working fine. Very good for a budget fitness band.",
        "date": "2024-12-28",
        "reviewer_name": "Stephen Harrogate",
        "rating": "Rated 5 out of 5 stars"
    },
    {
        "title": "SH*T Company",
        "description": "SH*T Company. Nightmare. Zero support. Will never buy anything from them. It's a loss of money. Don't trust their cheap products. Don't support lack of support and completely ignorant approach to customers.Whatever you ask them, they will always replay same email in words as this:Hello, Greetings from Xiaomi Customer Support! This is ****.Thanks for your feedback. We hope you could understand that the provision of after-sales services are undertaken by by the retailer after a customer has purchased a product. In other words, it pertains to any services provided after the retailer has sold products to customers. If you need after-sales service, please contact your point of purchase for better and quicker assistance.",
        "date": "2024-10-31",
        "reviewer_name": "Jack Denied",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "What a useless brand",
        "description": "What a useless brand, not sure how they in the market after scamming and making crappy phones. Would never suggest anyone get this brand even the high end flagship phones that cost a lot are bad.",
        "date": "2024-11-22",
        "reviewer_name": "Ophelia Watson",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "I recently purchased a Xiaomi 12 Lite",
        "description": "I recently purchased a Xiaomi 12 Lite, but after only three months, it developed a serious screen defect. Right after updating the device, colorful lines appeared on the screen. Unfortunately, the store where I bought it told me my warranty had expired after the standard 90-day period.When I reached out to consumer protection authorities (PROCON) here in Brazil, they determined the issue was the manufacturer’s responsibility. I tried contacting Xiaomi's support team by email, but they showed little interest in addressing my problem.I've been a Xiaomi user since the launch of the Mi 4c and have always trusted the brand. However, this experience has left me feeling completely disregarded and mistreated as a loyal customer.",
        "date": "2024-11-13",
        "reviewer_name": "Mateus De Souza",
        "rating": "Rated 2 out of 5 stars"
    },
    {
        "title": "Xiaomi Turkey did not take back the defective product and did not exercise the legal right",
        "description": "I bought a Redmi Pad Pro from the Xiaomi branch of TEKIRA Shopping Mall in Tekirdağ, Turkey on 11/11/2024 at 13:08. On 14/11/2024 at around 20:00, the tablet turned off spontaneously and started not to react at all. At around 21:00 on 14/11/2024, they declared that they could not return the defective product they sold at the Xiaomi branch in Istanbul Forum Istanbul, Turkey. 1. In accordance with the Law No. 6502 on Consumer Protection and the Regulation on Distance Contracts, we were not allowed to exercise our legal right to return it within 14 days without any justification, using the right of withdrawal. And instead of apologizing for the defective product and ensuring customer satisfaction, they left us in a victimized situation. We demand that the product be returned or replaced with a new one and our victimization be eliminated.",
        "date": "2024-11-14",
        "reviewer_name": "Yagmur Cem Gul",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Product not delivered",
        "description": "I'm still waiting for the delivery of my purchase (it has been 10 days already), and customer service has provided poor information. It is frustrating, considering the reviews that I have been reading about the company products...",
        "date": "2024-12-10",
        "reviewer_name": "Rodrigo Tramontina",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "False ecconomy",
        "description": "Thought it was a great buy at the price - but I am regretting. It is massively frustrating because of all the links to adverts and subscriptions. Avoid this phone.",
        "date": "2024-12-14",
        "reviewer_name": "NIGEL JONES",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Very poor service",
        "description": "Very poor service. Recently order new door bell. Very poor video quality. Even try to contact customer service for replacement but they made it may app settings not right. Every sharing all app settings no one replied to email.spend money for just a crap.Don’t buy xiaomi.",
        "date": "2024-10-18",
        "reviewer_name": "fiza saeed",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Scam company",
        "description": "Scam company, cancelled my order during shipping then tried to charge me more to reorder the same item. Customer service non existant, wish I had looked at review before ordering",
        "date": "2024-10-16",
        "reviewer_name": "Jack Jarvis",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Sh*** company",
        "description": "Don’t buy anything from this sh*** company, I bought a TV and I have it al 3 years and it’s full of problems like WiFi connection and frizzing problems and a very slow and low quality TV.DONT BUY!!!",
        "date": "2024-10-16",
        "reviewer_name": "dozdar",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Worst tech company, by far",
        "description": "As a software developer, dealing with this crap of a company has been a pain in the ass. When i´m using Android studio, and want to test out my app, I can´t use a digital phone simulation because i use Windows 11 (which is a Google/Android issue, but whatever) so my only option is to use the only Android I have at home - a Xiaomi. And since I use Windows (the only OS where you need a driver to connect androids to android studio), I go and download the driver from Xiaomi. But no, of course the Xiaomi developer forum looks like a cheap social media platform with a weird URL, I had to make sure that it was no fake website, it wasn´t, but the problem is that EVERYTHING is in chinese. And you can´t even change this. Anyways, I try to install the driver, manage to somehow not download a virus off of that cheap website and download it (which surprisingly took very long even though its just a small software), and guess what... It doesnt even freaking work! So, to all devs out there... use windows 10 or MacOS...And definitely not Xiaomi. Yeah. btw my name and pfp is something i made as a 10yo, don´t judge",
        "date": "2024-10-24",
        "reviewer_name": "BENGames",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "12s Ultra died after 6 months",
        "description": "Bought a phone a 12s Ultra from Ali express official store. Phone stopped working after 6 months. I've been a big Xiaomi user, I bought this phone for camera only, and won't be buying again.",
        "date": "2024-11-03",
        "reviewer_name": "james dunn",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Thanks You very much for a great…",
        "description": "Thanks You very much for a great service. I had a great experience using your phone unloking websiteMy IMEI 869228056504233",
        "date": "2024-10-28",
        "reviewer_name": "Yajaira",
        "rating": "Rated 5 out of 5 stars"
    },
    {
        "title": "Nothing more than a scam.",
        "description": "Got a Redmi 10 (2022) a couple of months ago and all i can say is that its not a phone. It simply does not function.The price was \"competitive\" though paying a few extra bucks could've gotten me a Motorola that is actually a competent device, and the phone just feels like it was made to swindle me. I was really happy with the phone at first, but then it just progressively got worse to the point that whenever i want to do something i know this phone can't handle, i just feel a sense of dread.For starters, plugging the phone in with a cable literally disables the touchscreen until i close and open the phone multiple times in a row like a maniac. My Bluetooth headphones (Zoopie Neo Plus) just disconnect at random. Running a resource intensive app makes basic system functions (including the keyboard) not function. Everything i do sends an annoying notification that i can't disable because it's \"important\" (yes xiaomi, i need a notification that i turned on battery saver mode. Does this phone think i can't use it?). The phone has several pointless system apps that i can't uninstall. Every app i install has to go through an annoying security check even if i downloaded it from the Play Store.I can excuse the ads in the system apps so they can reduce the price, but making the phone do all of the above and claiming it's \"value\" is downright a scam.This phone is barely a phone, and a lot of my friends agree with me. Xiaomi does not make electronics, i don't know what they are but if they don't work they aren't electronics.",
        "date": "2024-10-12",
        "reviewer_name": "alexthreefourthreexd",
        "rating": "Rated 1 out of 5 stars"
    },
    {
        "title": "Good phones",
        "description": "Good phones, worth their money. Probably the best VfM in the market.",
        "date": "2025-01-03",
        "reviewer_name": "Ορέστης Γεωργίου",
        "rating": "Rated 4 out of 5 stars"
    }
]